#include<stdio.h>
int main()
{
	int a[6][6]={{12,80,56,33,78,99},{11,81,14,43,55,88},{23,82,58,95,33,44},{13,79,52,78,63,22},{1,83,88,99,44,22},{33,84,41,48,74,85}};
	int i,j,max,min,k,p,m;
	for(i=0;i<6;i++)
	{
	    	k=0;
	       for(j=0;j<5;j++)//注意数组不能越界，j只能取到4，后面j要加1取到5 
	     {
	       if(a[i][k]<a[i][j+1])
	      {
	         k=j+1;
          }
            max=a[i][k];
         }
         	min=a[0][k];
	           for(p=0;p<5;p++) 
	        {
              if(min>a[p][k])
            {
               min=a[p][k];
               m=p;
            }
            }
        if(max==min)
        printf("%d %d",m,k);
     }
 }
