#include<stdio.h>
int main()
{
/*	int i,k,j;
	int a[7][5]={{1,2,3,4},{4,3,2,1},{5,6,7,8},{8,7,6,5},{4,5,6,7}};
	for(i=0;i<5;i++)
	{
		for(j=0;j<4;j++)
		{
			a[i][4]+=a[i][j]; 
		}
	}
	for(j=0;j<4;j++)
	{
		for(i=0;i<5;i++)
		{
			a[5][j]+=a[i][j];
		}
		a[6][j]=a[5][j]/5;
	}
	for(i=0;i<7;i++)
	{
		for(j=0;j<5;j++)
		{
			printf("%4d",a[i][j]);
		}
		printf("\n");
	}
}*/ 
	int sum=0,i,j;
	int a[7][6]={{98,78,88,87},{86,89,90,95},{94,80,77,93},{95,95,97,98},{90,84,89,90}}; 
	int *p;//定义列指针变量 
	int (*q)[6];//定义行指针变量 
	for(q=a;q<a+6;q++)//行指针变量可以直接这样写，而列指针变量必须是q=a[0] 
	{//q指向a数组的首行，它的值是a[0]这一行的地址，即&a[0] 
		sum=0;
		for(p=*q;p<*q+4;p++)//q指向a[0]这一行，*q的意思是a[0]这一行的首地址，即&a[0][0] 
		{//*q+4指的是第q行第4列的元素的地址 
			sum+=*p;
		}
		*p=sum;//把 第q行第4列的元素的地址对应元素的值赋成sum 
	//	*(p++)=sum/4;//这样写不对？？？？ 
		*(*q+5)=sum/4;//让第q行第5列元素的地址对应的元素的值赋成平均成绩 
	}
	p=a[0];//p指向a[0]这一行还是这一列？？？？意义是什么？？？ 
	for(j=0;j<4;j++)
	{
		for(i=0;i<5;i++)
		{
			*(p+(5*6+j))+=*(p+(i*6+j));        //a[5][j]+=a[i][j]		
		 }
		*(p+(6*6+j))=*(p+(6*i+j))/5;             //a[6][j]=a[5][j]/5
	}
    for(q=a;q<a+7;q++) 
	{
		for(p=*q;p<*q+6;p++)
		{
			printf("%4d",*p);
		}
		printf("\n");
	}
     return 0;
 } 

